#truth_research.py
#bool بحث و تجربة قيم الحقيقية في بايثون و الدالة
# لانه يعتبر قيمة فارغة  false سيطبع 
print (bool(""))
# لانه صفر  false سيطبع 
print (bool(0))
#لانه عدد عشري لكنه نفس  قية  الصفر  false سيطبع 
print (bool(0.0))
#لانه نص بسبب وجود علامتين التنصيص  True سيطبع
print (bool("false"))
#لانه نص بسبب وجود علامتين التنصيص حتى ولو كان يحتوي على صفر لان  كل شي داخل علامات التنصيص فهو نص   True سيطبع
print (bool("0"))

# توثيق طريقة الحل:
# (Truth Values) تم استخدام الذكاء الاصطناعي كبديل عن البحث في المواقع الإلكترونية، حيث قام الذكاء الاصطناعي بشرح موضوع القيم الحقيقية وتوضيح أسباب هذه المخرجات بالتفصيل  
